app/Controllers/Categorias.php

    public function index(){
        $model = new UsuariosModel();
        $usuario = $model->findAll();

        $model = new CategoriaModel();
        $categoria = $model->findAll();
---
SELECT *
FROM `usuario`
SELECT *
FROM `categoria`