app/Controllers/Cliente.php

    public function index(){
        $model = new ClienteModel();
        $clientes = $model->findAll();
---
SELECT *
FROM `cliente`

    public function show($id){
        $model = new ClienteModel();
        $cliente = $model->find($id);
---
SELECT *
FROM `cliente`
WHERE `cliente`.`clienteid` = '5'

    public function update($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $datos = $this->request->getRawInput();

        if (!empty($datos)) {
            $validation->setRules([
                "DNI" => 'required|string|max_length[255]',
                "Nombre" => 'required|string|max_length[255]',
                "ApellidoMaterno" => 'required|string|max_length[255]',
                "Telefono" => 'required|string|max_length[255]',
                "ApellidoPaterno" => 'required|string|max_length[255]'
            ]);

            $validation->withRequest($this->request)->run();

            if ($validation->getErrors()) {
                $errors = $validation->getErrors();
                $data = [
                    "Status" => 404,
                    "Detalles" => $errors
                ];
            } else {
                $model = new ClienteModel();
                $cliente = $model->find($id);
---
SELECT *
FROM `cliente`
WHERE `cliente`.`clienteid` = '0'