app/Controllers/Productos.php

INSERT INTO `producto` (`nombreproducto`, `precioventa`, `ubicacionproducto`, `codigobarras`, `idcategoria`, `idproveedor`) VALUES ('papaya', '12', 'en el mas alla', '134', '34', '29')
---
    public function create()
    {
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();

        $datos = array(
            "nombreproducto" => $request->getVar("nombreproducto"),
            "precioventa" => $request->getVar("precioventa"),
            "ubicacionproducto" => $request->getVar("ubicacionproducto"),
            "codigobarras" => $request->getVar("codigobarras"),
            "idcategoria" => $request->getVar("idcategoria"),
            "idproveedor" => $request->getVar("idproveedor")
        );

        if (!empty($datos)) {
            $validation->setRules([
                "nombreproducto" => 'required|string|max_length[255]',
                "precioventa" => 'required|string|max_length[255]',
                "ubicacionproducto" => 'required|string|max_length[255]',
                "codigobarras" => 'required|string|max_length[255]',
                "idcategoria" => 'required|integer',
                "idproveedor" => 'required|integer'
            ]);

            if ($validation->withRequest($request)->run() === false) {
                $errors = $validation->getErrors();
                $data = array("Status" => 404, "Detalle" => $errors);
            } else {
                $model = new ProductoModel();
                $model->insert($datos);