app/Controllers/Proveedor.php

    public function index(){
        $model = new ProveedorModel();
        $proveedores = $model->findAll();
---
SELECT *
FROM `proveedor`