app/Controllers/Usuarios.php

    public function index(){
        $model = new UsuariosModel();
        // Busca todos los usuarios sin filtrar por el campo 'estado'
        $usuarios = $model->findAll();
---
SELECT *
FROM `usuario`