app/Models/ProductoModel.php

SELECT *
FROM `producto` `c`
JOIN `categoria` `cat` ON `c`.`idcategoria` = `cat`.`idcategoria`
---
    public function getProductoWithCategoria()
    {
        return $this->db->table('producto c')
            ->join('categoria cat', 'c.idcategoria = cat.idcategoria')
            ->get()->getResultArray();

SELECT *
FROM `producto` `c`
JOIN `categoria` `cat` ON `c`.`idcategoria` = `cat`.`idcategoria`
WHERE `c`.`idproducto` = '1'
---
    public function getProductoByIdWithCategoria($id)
    {
        return $this->db->table('producto c')
            ->where('c.idproducto', $id)
            ->join('categoria cat', 'c.idcategoria = cat.idcategoria')
            ->get()->getResultArray();