app/Models/VentaModel.php

      public function getVentaWithCliente()
      {
          return $this->db->table('venta c')
              ->join('cliente p', 'c.clienteid = p.clienteid')
              ->get()->getResultArray();
---
SELECT *
FROM `venta` `c`
JOIN `cliente` `p` ON `c`.`clienteid` = `p`.`clienteid`